thibautldz/BLE_Scanner/STM32_WPAN/App/p2p_client_app.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    p2p_server_app.c
 * @author  MCD Application Team
 * @brief   peer to peer Server Application
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/

#include "main.h"
#include "app_common.h"

#include "dbg_trace.h"

#include "ble.h"
#include "p2p_client_app.h"

#include "stm32_seq.h"
#include "app_ble.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

typedef enum
{
  P2P_START_TIMER_EVT,
  P2P_STOP_TIMER_EVT,
  P2P_NOTIFICATION_INFO_RECEIVED_EVT,
} P2P_Client_Opcode_Notification_evt_t;

typedef struct
{
  uint8_t * pPayload;
  uint8_t     Length;
}P2P_Client_Data_t;

typedef struct
{
  P2P_Client_Opcode_Notification_evt_t  P2P_Client_Evt_Opcode;
  P2P_Client_Data_t DataTransfered;
}P2P_Client_App_Notification_evt_t;

typedef struct
{
  /**
   * state of the P2P Client
   * state machine
   */
  APP_BLE_ConnStatus_t state;

  /**
   * connection handle
   */
  uint16_t connHandle;

  /**
   * handle of the P2P service
   */
  uint16_t P2PServiceHandle;

  /**
   * end handle of the P2P service
   */
  uint16_t P2PServiceEndHandle;

  /**
   * handle of the Tx characteristic - Write To Server
   *
   */
  uint16_t P2PWriteToServerCharHdle;

  /**
   * handle of the client configuration
   * descriptor of Tx characteristic
   */
  uint16_t P2PWriteToServerDescHandle;

  /**
   * handle of the Rx characteristic - Notification From Server
   *
   */
  uint16_t P2PNotificationCharHdle;

  /**
   * handle of the client configuration
   * descriptor of Rx characteristic
   */
  uint16_t P2PNotificationDescHandle;

}P2P_ClientContext_t;

enum UUID_PROPERTIES
{
 UUID_READ               =   (0x02),
 UUID_WRITE_WNR          =   (0x04),
 UUID_READ_WRITE_WNR 	 =   (0x06),
 UUID_WRITE              =   (0x08),
 UUID_READ_WRITE		 =   (0x0A),
 UUID_NOTIFY		     =   (0x10),
 UUID_INDICATES	   		 =   (0x20),
};
uint8_t uuid_byte_one = 0;
uint8_t INDEX_DISC = 0;

#define MAX_PROPERTIES   20
#define MAX_SERVICES     10

typedef struct
{
	uint16_t handle_serv;
	uint8_t IdProperties[MAX_PROPERTIES];
} Service_scan_t;

Service_scan_t scan_services[MAX_SERVICES];
static uint8_t index_services;
static uint8_t index_properties;

/* USER CODE BEGIN PTD */
typedef struct{
  uint8_t                                     Device_Led_Selection;
  uint8_t                                     Led1;
}P2P_LedCharValue_t;

typedef struct{
  uint8_t                                     Device_Button_Selection;
  uint8_t                                     Button1;
}P2P_ButtonCharValue_t;

typedef struct
{

  uint8_t       Notification_Status; /* used to chek if P2P Server is enabled to Notify */

  P2P_LedCharValue_t         LedControl;
  P2P_ButtonCharValue_t      ButtonStatus;

  uint16_t ConnectionHandle; 


} P2P_Client_App_Context_t;

/* USER CODE END PTD */

/* Private defines ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
#define UNPACK_2_BYTE_PARAMETER(ptr)  \
        (uint16_t)((uint16_t)(*((uint8_t *)ptr))) |   \
        (uint16_t)((((uint16_t)(*((uint8_t *)ptr + 1))) << 8))
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/**
 * START of Section BLE_APP_CONTEXT
 */

PLACE_IN_SECTION("BLE_APP_CONTEXT") static P2P_ClientContext_t aP2PClientContext[BLE_CFG_CLT_MAX_NBR_CB];

/**
 * END of Section BLE_APP_CONTEXT
 */
/* USER CODE BEGIN PV */
PLACE_IN_SECTION("BLE_APP_CONTEXT") static P2P_Client_App_Context_t P2P_Client_App_Context;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void Gatt_Notification(P2P_Client_App_Notification_evt_t *pNotification);
static SVCCTL_EvtAckStatus_t Event_Handler(void *Event);
/* USER CODE BEGIN PFP */
static tBleStatus Write_Char(uint16_t UUID, uint8_t Service_Instance, uint8_t *pPayload);
static void Button_Trigger_Received( void );
static void Update_Service( void );
static void display_UUID( uint8_t * package, uint8_t idx );
static void rx_usartCallBack_Service( void );

aci_att_read_by_group_type_resp_event_rp0 * advertising_event;
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
/**
 * @brief  Service initialization
 * @param  None
 * @retval None
 */
uint8_t buff_services[2];
static void rx_usartCallBack_Service( void )
{
	uint8_t num_service = buff_services[0]-48;
	uint8_t num_property = buff_services[1]-48;


}
static void display_UUID( uint8_t * package, uint8_t idx )
{
	uint16_t avant1 = UNPACK_2_BYTE_PARAMETER(&package[idx+2]);
	uint16_t uuiddisp = UNPACK_2_BYTE_PARAMETER(&package[idx]);
	uint16_t apres1 = UNPACK_2_BYTE_PARAMETER(&package[idx-2]);
	uint16_t apres2 = UNPACK_2_BYTE_PARAMETER(&package[idx-4]);
	uint16_t apres3 = UNPACK_2_BYTE_PARAMETER(&package[idx-6]);
	uint16_t apres4 = UNPACK_2_BYTE_PARAMETER(&package[idx-8]);
	uint16_t apres5 = UNPACK_2_BYTE_PARAMETER(&package[idx-10]);
	uint16_t apres6 = UNPACK_2_BYTE_PARAMETER(&package[idx-12]);

	 APP_DBG_MSG("UUID : ");
	 APP_DBG_MSG("%4X",avant1);
	 APP_DBG_MSG("%4X",uuiddisp);
	 APP_DBG_MSG("-");
	 APP_DBG_MSG("%4X",apres1);
	 APP_DBG_MSG("-");
	 APP_DBG_MSG("%4X",apres2);
	 APP_DBG_MSG("-");
	 APP_DBG_MSG("%4X",apres3);
	 APP_DBG_MSG("-");
	 APP_DBG_MSG("%4X",apres4);
	 APP_DBG_MSG("%4X",apres5);
	 APP_DBG_MSG("%4X",apres6);
}

void P2PC_APP_Init(void)
{
  uint8_t index =0;
/* USER CODE BEGIN P2PC_APP_Init_1 */
  UTIL_SEQ_RegTask( 1<< CFG_TASK_SEARCH_SERVICE_ID, UTIL_SEQ_RFU, Update_Service );
  UTIL_SEQ_RegTask( 1<< CFG_TASK_SW1_BUTTON_PUSHED_ID, UTIL_SEQ_RFU, Button_Trigger_Received );

  /**
   * Initialize LedButton Service
   */
  P2P_Client_App_Context.Notification_Status=0;
  P2P_Client_App_Context.ConnectionHandle =  0x00;

  P2P_Client_App_Context.LedControl.Device_Led_Selection=0x00;/* device Led */
  P2P_Client_App_Context.LedControl.Led1=0x00; /* led OFF */
  P2P_Client_App_Context.ButtonStatus.Device_Button_Selection=0x01;/* Device1 */
  P2P_Client_App_Context.ButtonStatus.Button1=0x00;
/* USER CODE END P2PC_APP_Init_1 */
  for(index = 0; index < BLE_CFG_CLT_MAX_NBR_CB; index++)
  {
    aP2PClientContext[index].state= APP_BLE_IDLE;
  }

  /**
   *  Register the event handler to the BLE controller
   */
  SVCCTL_RegisterCltHandler(Event_Handler);

